import Container from "@/app/_components/Ui/Container";
import thumbnail from "@/assets/thumbnail.jpg"
import Link from "next/link";
import SideMenu from "../SideMenu";
import Image from "next/image";

const singleArticle = () => {
  return (
    <div>
      <header className="bg-primary text-white py-10 flex flex-col items-center justify-center">
        <h1 className="md:text-4xl text-3xl mx-5 md:mx-0 max-w-3xl leading-snug text-center font-bold">
          هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة
        </h1>
        <nav className="mt-7">
          <ol className="flex items-center gap-1 text-sm text-white">
            <li>
              <Link href="/" className="block transition hover:text-white/75">
                الرئيسية
              </Link>
            </li>

            <li className="rotate-180">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                className="size-4"
                viewBox="0 0 20 20"
                fill="currentColor"
              >
                <path
                  fillRule="evenodd"
                  d="M7.293 14.707a1 1 0 010-1.414L10.586 10 7.293 6.707a1 1 0 011.414-1.414l4 4a1 1 0 010 1.414l-4 4a1 1 0 01-1.414 0z"
                  clipRule="evenodd"
                />
              </svg>
            </li>

            <li>
              <Link
                href="/blog"
                className="block transition hover:text-white/75"
              >
                المدونة
              </Link>
            </li>

            <li className="rotate-180">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                className="size-4"
                viewBox="0 0 20 20"
                fill="currentColor"
              >
                <path
                  fillRule="evenodd"
                  d="M7.293 14.707a1 1 0 010-1.414L10.586 10 7.293 6.707a1 1 0 011.414-1.414l4 4a1 1 0 010 1.414l-4 4a1 1 0 01-1.414 0z"
                  clipRule="evenodd"
                />
              </svg>
            </li>

            <li>
              <Link
                href="/blog/ArticleId"
                className="block transition hover:text-white/75"
              >
                اسم المقال هنا
              </Link>
            </li>
          </ol>
        </nav>
      </header>
      <main className="my-10">
        <Container>
          <div className="grid grid-cols-12 gap-7">
            <div className="content col-span-12 md:col-span-8">
              <Image src={thumbnail} className="rounded-2xl mb-5 h-96 object-cover" alt="thumbnail" />
              <>
                <p>
                  &nbsp;
                  <span style={{ fontSize: 18 }}>
                    هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
                    توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل
                    هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد
                    الحروف التى يولدها التطبيق.
                  </span>
                </p>
                <br />
                <p style={{ fontSize: 18, lineHeight: "1.5" }}>
                  إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى
                  زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
                  لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
                  حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية
                  لتصميم الموقع.
                  <br style={{ marginBottom: 27 }} />
                  ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر
                  للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
                  عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه
                  التصميم فيظهر بشكل لا يليق.
                  <br style={{ marginBottom: 27 }} />
                  هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                  وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه
                  مازال نصاً بديلاً ومؤقتاً.
                </p>
                <br />
                <p style={{ fontSize: 18, lineHeight: "1.5" }}>
                  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
                  توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا
                  النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف
                  التى يولدها التطبيق.
                  <br style={{ marginBottom: 27 }} />
                  إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى
                  زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
                  لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
                  حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية
                  لتصميم الموقع.
                  <br style={{ marginBottom: 27 }} />
                  ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر
                  للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
                  عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه
                  التصميم فيظهر بشكل لا يليق.
                  <br style={{ marginBottom: 27 }} />
                  هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                  وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه
                  مازال نصاً بديلاً ومؤقتاً.
                </p>
                <br />
                <p style={{ fontSize: 18, lineHeight: "1.5" }}>
                  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
                  توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا
                  النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف
                  التى يولدها التطبيق.
                  <br style={{ marginBottom: 27 }} />
                  إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى
                  زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
                  لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
                  حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية
                  لتصميم الموقع.
                  <br style={{ marginBottom: 27 }} />
                  ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر
                  للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
                  عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه
                  التصميم فيظهر بشكل لا يليق.
                  <br style={{ marginBottom: 27 }} />
                  هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                  وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه
                  مازال نصاً بديلاً ومؤقتاً.
                </p>
                <br />
                <p style={{ fontSize: 18, lineHeight: "1.5" }}>
                  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
                  توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا
                  النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف
                  التى يولدها التطبيق.
                  <br style={{ marginBottom: 27 }} />
                  إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى
                  زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
                  لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
                  حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية
                  لتصميم الموقع.
                  <br style={{ marginBottom: 27 }} />
                  ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر
                  للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
                  عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه
                  التصميم فيظهر بشكل لا يليق.
                  <br style={{ marginBottom: 27 }} />
                  هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                  وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه
                  مازال نصاً بديلاً ومؤقتاً.
                </p>
                <br />
                <p style={{ fontSize: 18, lineHeight: "1.5" }}>
                  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم
                  توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا
                  النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف
                  التى يولدها التطبيق.
                  <br style={{ marginBottom: 27 }} />
                  إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى
                  زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء
                  لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص،
                  حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية
                  لتصميم الموقع.
                  <br style={{ marginBottom: 27 }} />
                  ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر
                  للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم
                  عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه
                  التصميم فيظهر بشكل لا يليق.
                  <br style={{ marginBottom: 27 }} />
                  هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو
                  وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه
                  مازال نصاً بديلاً ومؤقتاً.
                </p>
              </>
            </div>
            <div className="col-span-12 md:col-span-4">
              <SideMenu />
            </div>
          </div>
        </Container>
      </main>
    </div>
  );
};

export default singleArticle;
